# Based on Ultralytics: AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 62 # number of classes (a-z, A-Z, 0-9; nc=29 set in the data.yaml of upgraded Ganji Dataset)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 104 layers, 828,204 parameters, 828,188 gradients, 5.3 GFLOPs

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_Faster, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_Faster, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Faster, [512, True]]
  - [-1, 1, SPPF, [512, 5]] # 7

# head
head:
  - [-1, 3, C2f_Faster, [512]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [256]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [512]] # 14 (P4/16-medium)

  - [[11, 14], 1, Detect, [nc]] # Detect(P3, P4)